import React from "react";
import s from "./News.module.scss"


export default function NewsPage() {
  return (
    <>
    <div className={s.fullnews}>
      <h1>✓
         Apple представила новые планшеты iPad Pro с процессором M2 и поддержкой
        Wi-Fi 6E{" "}
      </h1>
      <div>
        ⭐︎ Устройства доступны для предзаказа, в магазинах появятся 26 октября.
      </div>
      <img
        src="https://leonardo.osnova.io/a2480409-c20e-59ed-a42b-f07f4c7224c0/-/preview/2100/-/format/webp/"
        alt=""
      />
      <div className={s.description}>
      <ul>
        <li>
          Apple показала шестое поколение планшетов iPad Pro с диагоналями 11 и
          12,9 дюймов и встроенной памятью на 128 Гб, 256 Гб, 512 Гб, 1 Тб и 2
          Тб. У моделей на 1 Тб и 2 Тб оперативная память составит 16 Гб.
        </li><br />
        <li>
          Устройства работают на процессорах М2, как в ноутбуках MacBook Air, а
          не М1, как раньше. В чипах восемь ядер CPU и 10 графических ядер GPU.
          Первые производительнее на 15%, вторые — на 35%, сообщила компания.
          Благодаря этому будет проще запускать «тяжеловесные» приложения,
          библиотеки и игры.
        </li><br />
        <li>
          Планшеты также получили поддержку нового стандарта Wi-Fi — 6E: он
          позволяет использовать диапазон в 6 ГГц в дополнение к 2,4 и 5 ГГц. А
          ещё на обоих устройствах установлена iPadOS 16, в которой, помимо
          прочего, улучшили адаптацию интерфейсов под размеры экрана. ОС
          выпустят 24 октября.
        </li><br />
        <li>
          Apple сообщила, что также усовершенствовала «медиадвижки» и камеры,
          так что теперь видео можно снимать в формате ProRes. Он позволяет
          записывать ролики, а также выполнять «многопоточный монтаж» в реальном
          времени без потери качества изображения. Конвертировать проекты в
          ProRes можно будет в три раза быстрее.
        </li><br />
        <li>
          Дизайн iPad Pro заметно не менялся с 2018 года, отмечает The Verge.
          Обе модели будут доступны в прежних двух цветах — «космическом сером»
          и серебристом.
        </li><br />
        <li><br />
          Вместе с планшетом Apple также представила новый Apple Pencil. Теперь
          устройство будет считывать приближение карандаша на расстоянии до 12
          мм над дисплеем. Это позволит художникам и дизайнерам «увидеть превью
          пометок ещё до их нанесения».
        </li><br />
        <li>
          Версия с 11-дюймовым дисплеем будет стоить от $799, а с 12-дюймовым от
          $1000. Предзаказ уже открыли, но в магазины устройства поступят только
          с 26 октября. Apple Pencil будет продаваться за $129.
        </li><br />
        <li>
          Apple также обновила iPad десятого поколения. Диагональ дисплея теперь
          составляет 10,9 дюйма, фронтальная камера располагается на более
          длинной рамке дисплея, а разъёмы Lightning заменили на USB-C.
        </li><br />
        <li>
          Компания, помимо этого, убрала кнопку «Домой» с нижней рамки —
          управлять устройством можно через Touch ID на кнопке питания. А ещё
          сменила процессорную систему с A13 Bionic на A14 Bionic.
        </li><br />
        <li>
          Обновлённая версия доступна в пыльно-голубом, розовом, серебристом и
          жёлтом цвете, а стоить будет от $449.
        </li><br />
      </ul>

      </div>
      <footer>
        <a href ="#">Pad</a>
        <span>Avtor</span>
        <span>08.12.2022 00:33</span>
        </footer>
    </div> 
    <br />



    <div className={s.fullnews}>
      <h1>✓
      Apple представила Apple Watch Ultra — «умные» часы для спортсменов и активного отдыха 
      </h1>
      <div>
        ⭐︎ «Самые надёжные из тех, что когда-либо создавались».
      </div>
      <img
        src="https://leonardo.osnova.io/76d56f8e-1d81-5857-93e2-f66a04237485/-/preview/2100/-/format/webp/"
        alt=""
      />
      <div className={s.description}>
      <ul>
        <li>
        Компания показала часы на своей осенней онлайн-презентации. The Verge называет их конкурентом профессиональным спортивным часам от Garmin и Polar.
        </li><br />
        <li>
        Часы представлены в новом дизайне с большим дисплеем 49 мм, титановым корпусом и сапфировым стеклом. Дисплей Retina с яркостью до 2000 нит — в два раза ярче, чем у других Apple Watch.
        </li><br />
        <li>
        Разработчики добавили второй динамик для большей громкости и установили сразу три микрофона — чтобы качество звука оставалось высоким «при любых условиях».
        </li><br />
        <li>
        Часы удобно использовать в перчатках. Благодаря дополнительной кнопке «действия» на левой стороне корпуса можно, например, быстро переключаться между стадиями марафона.
        </li><br />
        <li>
        Ultra обеспечивает до 36 часов работы на одном заряде при обычном использовании и до 60 часов в режиме энергосбережения.
        </li><br />
        <li><br />
        Приложение компаса полностью переработали. Например, с помощью кнопки «действия» можно отметить местоположение (начало тропы в лесу, размещение палатки и другие).
        </li><br />
        <li>
        GPS стандарта L1+L5 — для более точного отслеживания в больших городах. Есть встроенная сирена, которую слышно на расстоянии до 180 метров.
        </li><br />
        <li>
        Часы подходят для занятий водными видами спорта — например, кайтсёрфингом. Приложение покажет глубину при погружении, время под водой и её температуру.
        </li><br />
        <li>
        Есть три новых ремешка — специально для бегунов, исследователей и любителей экстремальных водных видов спорта.
        </li><br />
        <li>
        В магазинах с 23 сентября 2022 года. Стоят $799, в подарок дадут три месяца подписки Fitness+.
        </li><br />
      </ul>

      </div>
      <footer>
        <a href ="#">Whatch</a>
        <span>Avtor</span>
        <span>08.12.2022 01:12</span>
        </footer>
    </div>
    <br />
    <div className={s.fullnews}>
      <h1>✓
      На российском рынке появились iPhone 14 с двумя слотами для SIM-карт и неотключающимся звуком камеры      </h1>
      <div>
        ⭐︎ Сначала некоторые ритейлеры снизили цены на такие модели, но теперь продают по обычным, рассказали источники.
      </div>
      <img
        src="https://leonardo.osnova.io/0d4bcb94-8a41-5a38-b42e-bc42a7910788/-/preview/2100/-/format/webp/"
        alt=""
      />
      <div className={s.description}>
      <ul>
        <li>
        В России теперь можно купить iPhone 14 с двумя SIM-картами (модели для китайского рынка), без слота под SIM-карту (с eSIM, модели для США), японские и корейские версии — без возможности отключить звук камеры, рассказал рассказал «Коммерсанту» источник на рынке электроники. Другой отметил, что есть устройства для арабских стран, где не работает FaceTime.        </li><br />
        <li>
        Контрактный производитель Foxconn, который также работает на Apple в Китае, собирает модели iPhone 14 на заводе вблизи мегаполиса Ченнаи. Ожидается, что они поступят в продажу в конце этого года и будут предназначены для Индии, которая считается вторым по величине рынком смартфонов после Китая.        </li><br />
        <li>
        До сих пор компания производила в Индии в основном устройства старых поколений. Однако аналитики ожидают, что важность этой страны будет возрастать. По оценкам инвестиционного банка JP Morgan, в этом году Apple перенесет в Индию около пяти процентов производства iPhone 14. К 2025 году около четверти всей продукции компании будет производиться за пределами Китая.        </li><br />
        <li>
        В течение многих лет большинство продуктов компании Apple — включая Mac, iPad и Airpods — производятся в Китае. Производитель электроники в последнее время неоднократно ощутил на себе недостатки этой зависимости.        </li><br />
        <li>
        Например, когда компании Foxconn и другим контрактным производителям пришлось закрыть заводы из-за строгих правил Corona, это сильно повлияло на производство. "Мы не застрахованы от подобных проблем", — заявил весной генеральный директор, Тим Кук.        </li><br />
        <li><br />
        Напряженные отношения между США и Китаем, вероятно, также окажут влияние на стратегию Apple. Всего несколько дней назад несколько сенаторов США предостерегли компанию от использования чипов памяти спорного китайского производителя Yangtze Memory Technologies.        </li><br />
    
      </ul>

      </div>
      <footer>
        <a href ="#">Phone</a>
        <span>Avtor</span>
        <span>08.12.2022 01:26</span>
        </footer>
    </div>
    </>
    
  );
}
